#### Terraform Initialization ⚙️ - `success`
#### Terraform Validate 📃 - `success`
#### Terraform Plan 📖 - `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AIGISUK/gh-actions-terraform-digitalocean-ha-k3s/runs/run-oKPG2MGjwkRRhaWb

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ha-k3s.digitalocean_database_cluster.k3s will be created
  + resource "digitalocean_database_cluster" "k3s" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "k3s-ext-datastore"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "fra1"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "11"
    }

  # module.ha-k3s.digitalocean_database_user.dbuser will be created
  + resource "digitalocean_database_user" "dbuser" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "k3s_default_user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # module.ha-k3s.digitalocean_droplet.k3s_agent[0] will be created
  + resource "digitalocean_droplet" "k3s_agent" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = (known after apply)
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = [
          + "16:f7:96:34:6a:fd:d5:12:2e:e1:d0:cd:e6:b2:ac:d5",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "k3s_agent",
        ]
      + urn                  = (known after apply)
      + user_data            = (sensitive)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.ha-k3s.digitalocean_droplet.k3s_server[0] will be created
  + resource "digitalocean_droplet" "k3s_server" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = (known after apply)
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = [
          + "16:f7:96:34:6a:fd:d5:12:2e:e1:d0:cd:e6:b2:ac:d5",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "k3s_server",
        ]
      + urn                  = (known after apply)
      + user_data            = (sensitive)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.ha-k3s.digitalocean_droplet.k3s_server_init[0] will be created
  + resource "digitalocean_droplet" "k3s_server_init" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = (known after apply)
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = [
          + "16:f7:96:34:6a:fd:d5:12:2e:e1:d0:cd:e6:b2:ac:d5",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "k3s_server",
        ]
      + urn                  = (known after apply)
      + user_data            = (sensitive)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.ha-k3s.digitalocean_loadbalancer.k3s_lb will be created
  + resource "digitalocean_loadbalancer" "k3s_lb" {
      + algorithm                = "round_robin"
      + droplet_ids              = (known after apply)
      + droplet_tag              = "k3s_server"
      + enable_backend_keepalive = false
      + enable_proxy_protocol    = false
      + id                       = (known after apply)
      + ip                       = (known after apply)
      + name                     = "k3s-api-loadbalancer"
      + redirect_http_to_https   = false
      + region                   = "fra1"
      + size                     = "lb-small"
      + status                   = (known after apply)
      + urn                      = (known after apply)
      + vpc_uuid                 = (known after apply)

      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = (known after apply)
          + entry_port       = 6443
          + entry_protocol   = "https"
          + target_port      = 6443
          + target_protocol  = "https"
          + tls_passthrough  = true
        }

      + healthcheck {
          + check_interval_seconds   = 10
          + healthy_threshold        = 5
          + port                     = 6443
          + protocol                 = "tcp"
          + response_timeout_seconds = 5
          + unhealthy_threshold      = 3
        }

      + sticky_sessions {
          + cookie_name        = (known after apply)
          + cookie_ttl_seconds = (known after apply)
          + type               = (known after apply)
        }
    }

  # module.ha-k3s.digitalocean_project.k3s_cluster will be created
  + resource "digitalocean_project" "k3s_cluster" {
      + created_at  = (known after apply)
      + description = "k3s Cluster"
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = (known after apply)
      + name        = "k3s-cluster"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "HA K3s (Kubernetes) Cluster"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # module.ha-k3s.digitalocean_project_resources.k3s_agent_nodes[0] will be created
  + resource "digitalocean_project_resources" "k3s_agent_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # module.ha-k3s.digitalocean_project_resources.k3s_api_server_lb will be created
  + resource "digitalocean_project_resources" "k3s_api_server_lb" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # module.ha-k3s.digitalocean_project_resources.k3s_ext_datastore will be created
  + resource "digitalocean_project_resources" "k3s_ext_datastore" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # module.ha-k3s.digitalocean_project_resources.k3s_init_server_node[0] will be created
  + resource "digitalocean_project_resources" "k3s_init_server_node" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # module.ha-k3s.digitalocean_project_resources.k3s_server_nodes[0] will be created
  + resource "digitalocean_project_resources" "k3s_server_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # module.ha-k3s.digitalocean_vpc.k3s_vpc will be created
  + resource "digitalocean_vpc" "k3s_vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "k3s-vpc-01"
      + region     = "fra1"
      + urn        = (known after apply)
    }

  # module.ha-k3s.random_id.agent_node_id[0] will be created
  + resource "random_id" "agent_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ha-k3s.random_id.server_node_id[0] will be created
  + resource "random_id" "server_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ha-k3s.random_id.server_node_id[1] will be created
  + resource "random_id" "server_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ha-k3s.random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = false
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_summary = {
      + agents         = [
          + {
              + id         = (known after apply)
              + ip_private = (known after apply)
              + ip_public  = (known after apply)
              + name       = (known after apply)
              + price      = (known after apply)
            },
        ]
      + api_server_ip  = (known after apply)
      + cluster_region = "fra1"
      + servers        = [
          + {
              + id         = (known after apply)
              + ip_private = (known after apply)
              + ip_public  = (known after apply)
              + name       = (known after apply)
              + price      = (known after apply)
            },
          + {
              + id         = (known after apply)
              + ip_private = (known after apply)
              + ip_public  = (known after apply)
              + name       = (known after apply)
              + price      = (known after apply)
            },
        ]
    }
```

</details>

*Pusher: @colinwilson, Action: `pull_request`, Workdir: `examples/github_actions`, Workflow: `Terraform GitHub Actions`*